9/data/attachments/28caedce18ac2293.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_6196c979-998b-4cd7-ae02-32784bd99aab</nif:username>
            <nif:friendToBeAdded>Melissa_because_Actions_1067_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>